var code = [
  {id:'101',msg:'未知错误'},
  {id:'102',msg:'用户不存在'},
  {id:'103',msg:'用户密码错误'},
  {id:'105',msg:'缺失参数'},
  {id:'106',msg:'数据库查询错误'},
  {id:'107',msg:'用户未登录'},
  {id:'108',msg:'调用密钥错误'},
  {id:'109',msg:'调用接口错误'},
  {id:'111',msg:'无数据'},
  {id:'112',msg:'错误json字符串参数'},
  {id:'113',msg:'没有任何更新'},
  {id:'2010',msg:'标签规则为空'},
  {id:'2011',msg:'标签规则解释时错误'},
  {id:'2012',msg:'未选择要组合的标签'},
  {id:'2013',msg:'标签名称重复'},
  {id:'2014',msg:'无宽表数据或者宽表数据缺失'},
  {id:'2020',msg:'标签目录名称重复'},
  {id:'2021',msg:'标签目录下有标签或子目录'},
  {id:'520',msg:'系统出错啦'},
  {id:'521',msg:'请检查参数是否正确，执行数据库操作时出现错误'}
]

export {code}
